[Killed] BlockStatement
src/calculator.js:1:27
-export function sum(a, b) {
-  return a + b
-}
+export function sum(a, b) {}
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/calculator.js:2:10
 export function sum(a, b) {
-  return a + b
+  return a - b
 }
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1
