[Killed] BlockStatement
src/calculator.js:1:30
-export function sum(...args) {
-  if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc + v, 0)
-}
+export function sum(...args) {}
 
 export function subtract(...args) {
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/calculator.js:2:7
 export function sum(...args) {
-  if (args.length === 0) return 0
+  if (true) return 0
   return args.reduce((acc, v) => acc + v, 0)
 }
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/calculator.js:2:7
 export function sum(...args) {
-  if (args.length === 0) return 0
+  if (args.length !== 0) return 0
   return args.reduce((acc, v) => acc + v, 0)
 }
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/calculator.js:3:34
 export function sum(...args) {
   if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc + v, 0)
+  return args.reduce((acc, v) => acc - v, 0)
 }
 
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] ArrowFunction
src/calculator.js:3:22
 export function sum(...args) {
   if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc + v, 0)
+  return args.reduce(() => undefined, 0)
 }
 
killedBy: adds 2 + 3 = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[NoCoverage] BlockStatement
src/calculator.js:6:35
   return args.reduce((acc, v) => acc + v, 0)
 }
 
-export function subtract(...args) {
-  if (args.length === 0) return 0
-  if (args.length === 1) return -args[0]
-  return args.slice(1).reduce((acc, v) => acc - v, args[0])
-}
+export function subtract(...args) {}
 
 export function multiply(...args) {

[NoCoverage] ConditionalExpression
src/calculator.js:7:7
 }
 
 export function subtract(...args) {
-  if (args.length === 0) return 0
+  if (true) return 0
   if (args.length === 1) return -args[0]
   return args.slice(1).reduce((acc, v) => acc - v, args[0])

[NoCoverage] EqualityOperator
src/calculator.js:7:7
 }
 
 export function subtract(...args) {
-  if (args.length === 0) return 0
+  if (args.length !== 0) return 0
   if (args.length === 1) return -args[0]
   return args.slice(1).reduce((acc, v) => acc - v, args[0])

[NoCoverage] UnaryOperator
src/calculator.js:8:33
 
 export function subtract(...args) {
   if (args.length === 0) return 0
-  if (args.length === 1) return -args[0]
+  if (args.length === 1) return +args[0]
   return args.slice(1).reduce((acc, v) => acc - v, args[0])
 }

[NoCoverage] ConditionalExpression
src/calculator.js:8:7
 
 export function subtract(...args) {
   if (args.length === 0) return 0
-  if (args.length === 1) return -args[0]
+  if (true) return -args[0]
   return args.slice(1).reduce((acc, v) => acc - v, args[0])
 }

[NoCoverage] ArithmeticOperator
src/calculator.js:9:43
 export function subtract(...args) {
   if (args.length === 0) return 0
   if (args.length === 1) return -args[0]
-  return args.slice(1).reduce((acc, v) => acc - v, args[0])
+  return args.slice(1).reduce((acc, v) => acc + v, args[0])
 }
 

[NoCoverage] MethodExpression
src/calculator.js:9:10
 export function subtract(...args) {
   if (args.length === 0) return 0
   if (args.length === 1) return -args[0]
-  return args.slice(1).reduce((acc, v) => acc - v, args[0])
+  return args.reduce((acc, v) => acc - v, args[0])
 }
 

[NoCoverage] BlockStatement
src/calculator.js:12:35
   return args.slice(1).reduce((acc, v) => acc - v, args[0])
 }
 
-export function multiply(...args) {
-  if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc * v, 1)
-}
+export function multiply(...args) {}
 
 export function divide(...args) {

[NoCoverage] EqualityOperator
src/calculator.js:13:7
 }
 
 export function multiply(...args) {
-  if (args.length === 0) return 0
+  if (args.length !== 0) return 0
   return args.reduce((acc, v) => acc * v, 1)
 }

[NoCoverage] ConditionalExpression
src/calculator.js:13:7
 }
 
 export function multiply(...args) {
-  if (args.length === 0) return 0
+  if (true) return 0
   return args.reduce((acc, v) => acc * v, 1)
 }

[NoCoverage] ArrowFunction
src/calculator.js:14:22
 
 export function multiply(...args) {
   if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc * v, 1)
+  return args.reduce(() => undefined, 1)
 }
 

[NoCoverage] ArithmeticOperator
src/calculator.js:14:34
 
 export function multiply(...args) {
   if (args.length === 0) return 0
-  return args.reduce((acc, v) => acc * v, 1)
+  return args.reduce((acc, v) => acc / v, 1)
 }
 

[NoCoverage] BlockStatement
src/calculator.js:17:33
   return args.reduce((acc, v) => acc * v, 1)
 }
 
-export function divide(...args) {
-  if (args.length === 0) return NaN
-  if (args.length === 1) return 1 / args[0]
-  return args.slice(1).reduce((acc, v) => {
-    if (v === 0) throw new Error('Division by zero')
-    return acc / v
-  }, args[0])
-}
+export function divide(...args) {}
 
 export function pow(a, b) {

[NoCoverage] EqualityOperator
src/calculator.js:18:7
 }
 
 export function divide(...args) {
-  if (args.length === 0) return NaN
+  if (args.length !== 0) return NaN
   if (args.length === 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {

[NoCoverage] ConditionalExpression
src/calculator.js:18:7
 }
 
 export function divide(...args) {
-  if (args.length === 0) return NaN
+  if (true) return NaN
   if (args.length === 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {

[NoCoverage] EqualityOperator
src/calculator.js:19:7
 
 export function divide(...args) {
   if (args.length === 0) return NaN
-  if (args.length === 1) return 1 / args[0]
+  if (args.length !== 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {
     if (v === 0) throw new Error('Division by zero')

[NoCoverage] ConditionalExpression
src/calculator.js:19:7
 
 export function divide(...args) {
   if (args.length === 0) return NaN
-  if (args.length === 1) return 1 / args[0]
+  if (true) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {
     if (v === 0) throw new Error('Division by zero')

[NoCoverage] BlockStatement
src/calculator.js:20:43
 export function divide(...args) {
   if (args.length === 0) return NaN
   if (args.length === 1) return 1 / args[0]
-  return args.slice(1).reduce((acc, v) => {
-    if (v === 0) throw new Error('Division by zero')
-    return acc / v
-  }, args[0])
+  return args.slice(1).reduce((acc, v) => {}, args[0])
 }
 

[NoCoverage] MethodExpression
src/calculator.js:20:10
 export function divide(...args) {
   if (args.length === 0) return NaN
   if (args.length === 1) return 1 / args[0]
-  return args.slice(1).reduce((acc, v) => {
+  return args.reduce((acc, v) => {
     if (v === 0) throw new Error('Division by zero')
     return acc / v

[NoCoverage] ConditionalExpression
src/calculator.js:21:9
   if (args.length === 0) return NaN
   if (args.length === 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {
-    if (v === 0) throw new Error('Division by zero')
+    if (false) throw new Error('Division by zero')
     return acc / v
   }, args[0])

[NoCoverage] EqualityOperator
src/calculator.js:21:9
   if (args.length === 0) return NaN
   if (args.length === 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {
-    if (v === 0) throw new Error('Division by zero')
+    if (v !== 0) throw new Error('Division by zero')
     return acc / v
   }, args[0])

[NoCoverage] ArithmeticOperator
src/calculator.js:22:12
   if (args.length === 1) return 1 / args[0]
   return args.slice(1).reduce((acc, v) => {
     if (v === 0) throw new Error('Division by zero')
-    return acc / v
+    return acc * v
   }, args[0])
 }

[NoCoverage] BlockStatement
src/calculator.js:26:27
   }, args[0])
 }
 
-export function pow(a, b) {
-  return Math.pow(a, b)
-}
+export function pow(a, b) {}
 
 export function sqrt(a) {

[NoCoverage] BlockStatement
src/calculator.js:30:25
   return Math.pow(a, b)
 }
 
-export function sqrt(a) {
-  return Math.sqrt(a)
-}
+export function sqrt(a) {}
 
 export function average(...args) {

[NoCoverage] BlockStatement
src/calculator.js:34:34
   return Math.sqrt(a)
 }
 
-export function average(...args) {
-  if (args.length === 0) return NaN
-  return sum(...args) / args.length
-}
+export function average(...args) {}
 
 export function abs(a) {

[NoCoverage] EqualityOperator
src/calculator.js:35:7
 }
 
 export function average(...args) {
-  if (args.length === 0) return NaN
+  if (args.length !== 0) return NaN
   return sum(...args) / args.length
 }

[NoCoverage] ConditionalExpression
src/calculator.js:35:7
 }
 
 export function average(...args) {
-  if (args.length === 0) return NaN
+  if (false) return NaN
   return sum(...args) / args.length
 }

[NoCoverage] ArithmeticOperator
src/calculator.js:36:10
 
 export function average(...args) {
   if (args.length === 0) return NaN
-  return sum(...args) / args.length
+  return sum(...args) * args.length
 }
 

[NoCoverage] BlockStatement
src/calculator.js:39:24
   return sum(...args) / args.length
 }
 
-export function abs(a) {
-  return Math.abs(a)
-}
+export function abs(a) {}
 
 export function negate(a) {

[NoCoverage] BlockStatement
src/calculator.js:43:27
   return Math.abs(a)
 }
 
-export function negate(a) {
-  return -a
-}
+export function negate(a) {}
 
 export function percent(value, of) {

[NoCoverage] UnaryOperator
src/calculator.js:44:10
 }
 
 export function negate(a) {
-  return -a
+  return +a
 }
 

[NoCoverage] BlockStatement
src/calculator.js:47:36
   return -a
 }
 
-export function percent(value, of) {
-  if (of === undefined) return value / 100
-  return (value / 100) * of
-}
+export function percent(value, of) {}

[NoCoverage] EqualityOperator
src/calculator.js:48:7
 }
 
 export function percent(value, of) {
-  if (of === undefined) return value / 100
+  if (of !== undefined) return value / 100
   return (value / 100) * of
 }

[NoCoverage] ConditionalExpression
src/calculator.js:48:7
 }
 
 export function percent(value, of) {
-  if (of === undefined) return value / 100
+  if (true) return value / 100
   return (value / 100) * of
 }

[NoCoverage] ArithmeticOperator
src/calculator.js:49:11
 
 export function percent(value, of) {
   if (of === undefined) return value / 100
-  return (value / 100) * of
+  return (value * 100) * of
 }

[NoCoverage] ArithmeticOperator
src/calculator.js:49:10
 
 export function percent(value, of) {
   if (of === undefined) return value / 100
-  return (value / 100) * of
+  return value / 100 / of
 }
